In [46]:
import numpy as np
import pandas as pd

trainDS = pd.read_csv(r'C:\Users\MY\Downloads\Datasets\TitanicDataset\train.csv')
trainDS.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [47]:
trainDS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [48]:
trainDS.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [49]:
trainDS.groupby('Pclass').mean()['Age']

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [50]:
def filla(w):
    if(pd.isnull(w['Age'])):
        w['Age'] = trainDS.groupby('Pclass').mean()['Age'][w['Pclass']]
    else:
        w = w
        
    return w

trainDS = trainDS.apply(filla, axis = 1)

In [51]:
trainDS['Age'][95]

25.14061971830986

In [52]:
trainDS['Embarked'].fillna(trainDS['Embarked'].mode()[0], inplace = True)

In [53]:
X = trainDS

In [54]:
def S(x):
    if(x == 'male'):
        x = 1
    else:
        x = 0
        
    return x 

X['Sex'] = X['Sex'].apply(lambda x: S(x))

In [55]:
X['Sex'][: 10]

0    1
1    0
2    0
3    0
4    1
5    1
6    1
7    1
8    0
9    0
Name: Sex, dtype: int64

In [56]:
from sklearn.preprocessing import MinMaxScaler
import matplotlib.pyplot as plt

Age = X['Age'].values
Age = Age.reshape(-1, 1)
scaler = MinMaxScaler()
X['Age'] = scaler.fit_transform(Age)

In [57]:
Fare = X['Fare'].values
Fare = Fare.reshape(-1, 1)
X['Fare'] = scaler.fit_transform(Fare)

In [58]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    int64
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(6), object(4)
memory usage: 83.7+ KB

In [59]:
Embarked = pd.get_dummies(X['Embarked'], drop_first = True)
X = pd.concat([X, Embarked], axis = 1)

In [60]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    int64
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    object
 12  Q            891 non-null    uint8
 13  S            891 non-null    uint8
dtypes: float64(2), int64(6), object(4), uint8(2)
memory usage: 85.4+ KB

In [61]:
X['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [62]:
X = X.drop(['PassengerId', 'Name', 'Ticket', 'Cabin'], axis = 1)

In [63]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    int64
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  891 non-null    object
 8   Q         891 non-null    uint8
 9   S         891 non-null    uint8
dtypes: float64(2), int64(5), object(1), uint8(2)
memory usage: 57.6+ KB

In [64]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

K = X
K = K.drop(['Embarked', 'Survived'], axis = 1)
K.info()
all_features = np.array(K)
all_labels = np.array(X['Survived'])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Sex     891 non-null    int64
 2   Age     891 non-null    float64
 3   SibSp   891 non-null    int64
 4   Parch   891 non-null    int64
 5   Fare    891 non-null    float64
 6   Q       891 non-null    uint8
 7   S       891 non-null    uint8
dtypes: float64(2), int64(4), uint8(2)
memory usage: 43.6 KB

In [65]:
K.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Sex     891 non-null    int64
 2   Age     891 non-null    float64
 3   SibSp   891 non-null    int64
 4   Parch   891 non-null    int64
 5   Fare    891 non-null    float64
 6   Q       891 non-null    uint8
 7   S       891 non-null    uint8
dtypes: float64(2), int64(4), uint8(2)
memory usage: 43.6 KB

In [66]:
from sklearn.neighbors import KNeighborsClassifier
from sklearn.model_selection import cross_val_score

X = []
for i in range(1, 50):
    modelK = KNeighborsClassifier(n_neighbors = i)
    scores = cross_val_score(modelK, all_features, all_labels, cv = 10)
    X.append([scores.mean()])
    print(i, scores.mean())

print(max(X))

1 0.7408614232209738
2 0.7755930087390762
3 0.8003121098626715
4 0.7912983770287141
5 0.7901622971285892
6 0.7924219725343321
7 0.7957677902621724
8 0.7957303370786517
9 0.7923720349563046
10 0.8035955056179775
11 0.7946317103620475
12 0.8080774032459426
13 0.8013732833957553
14 0.8080898876404495
15 0.8047440699126092
16 0.8092009987515606
17 0.8047066167290886
18 0.8103121098626718
19 0.8069538077403247
20 0.8136953807740325
21 0.8125717852684143
22 0.8136828963795256
23 0.8148064918851435
24 0.8170536828963796
25 0.8159425717852684
26 0.8103245942571785
27 0.8125593008739076
28 0.7991260923845194
29 0.8058676654182271
30 0.7946317103620475
31 0.7991260923845194
32 0.7923970037453183
33 0.7935205992509363
34 0.7867790262172284
35 0.7856554307116104
36 0.7789138576779027
37 0.7834082397003745
38 0.7867790262172285
39 0.7867790262172284
40 0.7789138576779027
41 0.7834207240948815
42 0.7856554307116104
43 0.7867790262172284
44 0.7845318352059925
45 0.7800624219725344
46 0.7811735330836455
47 0.7879151061173533
48 0.7890387016229712
49 0.7912858926342072
[0.8170536828963796]

In [67]:
KNC = KNeighborsClassifier(n_neighbors = 24)
scores = cross_val_score(KNC, all_features, all_labels, cv = 10)
print(scores.mean())

0.8170536828963796

In [68]:
testDS = pd.read_csv(r'C:\Users\MY\Downloads\Datasets\TitanicDataset\test.csv')
testDS.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [69]:
testDS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [70]:
testDS.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [71]:
testDS.groupby('Pclass').mean()['Age']

Pclass
1    40.918367
2    28.777500
3    24.027945
Name: Age, dtype: float64

In [72]:
def fillat(w):
    if(pd.isnull(w['Age'])):
        w['Age'] = testDS.groupby('Pclass').mean()['Age'][w['Pclass']]
    else:
        w = w
        
    return w

testDS = testDS.apply(fillat, axis = 1)

In [73]:
Y = testDS

In [74]:
Y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [75]:
Y[Y['Fare'].isnull()].index.tolist()

[152]

In [76]:
M = Y['Fare'].mean()

In [77]:
def fillf(w):
    if(pd.isnull(w['Fare'])):
        w['Fare'] = M
    else:
        w = w
    return w
Y = Y.apply(fillf, axis = 1)

In [78]:
Y['Fare'][152]

35.6271884892086

In [79]:
def S(x):
    if(x == 'male'):
        x = 1
    else:
        x = 0
        
    return x 

Y['Sex'] = Y['Sex'].apply(lambda x: S(x))

In [80]:
Age = Y['Age'].values
Age = Age.reshape(-1, 1)
scaler = MinMaxScaler()
Y['Age'] = scaler.fit_transform(Age)

In [81]:
Fare = Y['Fare'].values
Fare = Fare.reshape(-1, 1)
Y['Fare'] = scaler.fit_transform(Fare)

In [82]:
Embarked = pd.get_dummies(Y['Embarked'], drop_first = True)
Y = pd.concat([Y, Embarked], axis = 1)

In [83]:
J = Y
J.info()
J = J.drop(['PassengerId', 'Name', 'Ticket', 'Cabin', 'Embarked'], axis = 1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    int64
 4   Age          418 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         418 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
 11  Q            418 non-null    uint8
 12  S            418 non-null    uint8
dtypes: float64(2), int64(5), object(4), uint8(2)
memory usage: 36.9+ KB

In [84]:
J.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  418 non-null    int64
 1   Sex     418 non-null    int64
 2   Age     418 non-null    float64
 3   SibSp   418 non-null    int64
 4   Parch   418 non-null    int64
 5   Fare    418 non-null    float64
 6   Q       418 non-null    uint8
 7   S       418 non-null    uint8
dtypes: float64(2), int64(4), uint8(2)
memory usage: 20.5 KB

In [85]:
KNC.fit(all_features, all_labels)

predictions = KNC.predict(J)
print(predictions)

[0 0 0 0 1 0 1 0 1 0 0 0 1 0 1 1 0 0 0 0 1 0 1 0 1 0 1 0 0 0 0 0 0 1 0 0 0
 0 0 0 0 0 0 1 1 0 0 0 1 1 0 0 1 1 0 0 0 0 0 1 0 0 0 1 1 1 1 0 0 1 1 0 0 0
 1 0 0 1 0 1 0 0 0 0 0 0 1 0 1 1 0 0 1 0 0 0 1 0 0 0 1 0 0 0 1 0 0 0 0 0 0
 1 1 1 1 0 0 1 0 1 1 0 1 0 0 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 0 0 0
 0 0 1 0 0 1 0 0 1 0 0 1 1 0 1 0 0 1 0 0 1 0 0 0 0 0 0 1 1 1 1 1 0 1 1 0 1
 0 1 0 0 0 0 0 0 0 1 0 1 0 0 0 1 1 1 1 0 0 1 0 1 0 0 0 0 1 0 0 1 0 1 0 1 0
 1 0 1 1 0 1 0 0 0 1 0 0 0 0 1 0 1 1 1 1 1 0 0 0 1 0 1 1 1 0 1 0 0 0 0 0 1
 0 0 0 1 1 0 0 0 0 0 0 0 0 1 1 0 1 0 0 0 0 0 1 1 1 1 0 0 0 0 0 0 1 0 0 0 0
 1 0 0 0 0 0 0 0 1 1 1 0 0 0 0 0 0 1 1 1 1 0 0 0 0 0 0 0 1 0 1 0 0 0 1 0 0
 1 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1 1 0 0 1 1 0 1 0 0 0 0 1 1 0 1 0 0 0 1 0
 0 1 0 0 1 1 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 1 0 1 0 0 1 0 1 0 0 0 0
 1 1 1 1 1 0 0 1 0 0 0]

In [86]:
predictions.size

418

In [87]:
R = pd.Series(predictions)
R.shape

(418,)

In [88]:
P = pd.Series(testDS['PassengerId'])
P.shape

(418,)

In [89]:
K = pd.concat([P, R], axis = 1)

In [90]:
K

     PassengerId  0
0            892  0
1            893  0
2            894  0
3            895  0
4            896  1
..           ... ..
413         1305  0
414         1306  1
415         1307  0
416         1308  0
417         1309  0

[418 rows x 2 columns]

In [91]:
df = pd.DataFrame(K).reset_index()
df.columns = ['Index', 'PassengerId', 'Survived']
df = df.drop(['Index'], axis = 1)

In [92]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
dtypes: int64(2)
memory usage: 6.7 KB

In [93]:
df['Survived'].value_counts()

0    279
1    139
Name: Survived, dtype: int64

In [94]:
df.to_csv(r'C:\Users\MY\Downloads\Datasets\TitanicDataset\KNC.csv', index = False)